org/blog.org
:CONFIG:
#+hugo_base_dir: ../
#+seq_todo: TODO DRAFT DONE
#+options: creator:t
#+macro: updatetime {{{time(%B %e\, %Y)}}}
#+hugo_auto_set_lastmod: t
#+startup: hidestars
#+startup: overview
#+startup: logdone
# #+startup: inlineimages
# #+startup: latexpreview
:END:

#+title: Blog Source File
#+author: Prashant Tak

** Creating a blog using ox-hugo
CLOSED: [2021-03-21 Mon 02:00]
:PROPERTIES:
:EXPORT_FILE_NAME: blog-creation
:END:

I was going to make a post explaining how I made this blog but it was rendered pretty useless by [[https://dev.to/usamasubhani/setup-a-blog-with-hugo-and-github-pages-562n][this.]] So yeah, I might archive this later.

1. Install hugo from your package manager.
2. Create a new site:
   #+begin_src sh
hugo new site blog
   #+end_src
3. Add a theme:
   #+begin_src sh
cd blog
git init
git submodule add <theme_url> themes/<name>
   #+end_src
4. Install ox-hugo in emacs
   #+begin_src emacs-lisp
;; goes in packages.el
(package! ox-hugo)

;; goes in config.el
(use-package ox-hugo
  :after ox)
   #+end_src
5. TODO Explain the process of content and properties, tags etc.
6. Export
7. Config.toml (theme, title, url, publishdir, etc)
8. Run server, check localhost.
9. Push
10. Go to GitHub repository Settings > GitHub pages. Select /docs in Source.
11. Voila!
